Re3AoA10/system/forceCoeffsIncompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates lift, drag and moment coefficients by summing forces on
    specified patches for a case where the solver is incompressible; i.e.,
    pressure is kinematic and has units of m^2/s^2.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/functions/forces/forceCoeffsIncompressible.cfg"
#include "$FOAM_CASE/include/data";

patches     (naca0012); // Names of patches on which to calculate forces

magUInf     $vel;      // Far field velocity magnitude; e.g., 20 m/s
lRef        1;         // Reference length scale for moment calculations;
                            // e.g., 1 m
Aref        0.901388;         // Reference area; e.g., 1 m^2

CofR        (0 0 0);         // Centre of rotation; e.g., (0 0 0)
liftDir     ($Lx $Ly 0);      // Direction of lift force; e.g., (0 0 1)
dragDir     ($Dx $Dy 0);      // Direction of drag force; e.g., (1 0 0)
pitchAxis   (0 0 -1);    // Pitch axis; e.g., (0 1 0)


// ************************************************************************* //
